/*********************************************************
文 件 名 : API.C
文件说明 : 应用接口处理
编写作者 : thm
修订作者 : 
编写时间 : 2020-12-7
版 本 号 : V1.0
==========================================================*/
//头文件
#include "COMMON\AllInclude.h"
#include "API\API_C.h"



/*****************************************************
*函数名称：void F_TIME_ModeSet(void)
*函数功能：模式设置时间处理
*输入参数：无
*输出参数：无
*调用周期：100mS
*说明：
*****************************************************/
void F_TIME_ModeSet(void)
{

}
