
#include "..\Include\Include.h"

/********************************************************************************************************
* @ name   : static void IO_Init(void)
* @ msg    : GPIO初始化
* @ param   (*)
* @ return  (*)
 ********************************************************************************************************/

static void IO_Init(void)
{
	P0 = 0x00;
	P1 = 0x00;
	P2 = 0x00;

	
	P0M0 = P0M0&0xF0|0x08;				//P00设置为推挽输出	//RX
	P0M0 = P0M0&0x0F|0x80;              //P01设置为推挽输出	//TX
	P0M1 = P0M1&0xF0|0x08;				//P02设置为推挽输出	
	P0M1 = P0M1&0x0F|0x80;              //P03设置为推挽输出	
	P0M2 = P0M2&0xF0|0x08;				//P04设置为推挽输出	
	P0M2 = P0M2&0x0F|0x80;              //P05设置为推挽输出	
	P0M3 = P0M3&0xF0|0x03;				//P06设置为模拟输入
	P0M3 = P0M3&0x0F|0x80;              //P07设置为推挽输出	

	P1M0 = P1M0&0xF0|0x08;				//P10设置为推挽输出	
	P1M0 = P1M0&0x0F|0x80;              //P11设置为推挽输出	


	P2M1 = P2M1&0x0F|0x80;				//P23设置为推挽输出	
	P2M2 = P2M2&0xF0|0x08;				//P24设置为推挽输出	
	P2M2 = P2M2&0x0F|0x80;              //P25设置为推挽输出	
	P2M3 = P2M3&0xF0|0x08;				//P26设置为推挽输出	
	P2M3 = P2M3&0x0F|0x80;              //P27设置为推挽输出	


	P0 = 0x00;
	P1 = 0x00;
	P2 = 0x00;
}

/********************************************************************************************************
* @ name   : void Timer_Init(void)
* @ msg    : 定时器初始化
* @ param   (*)
* @ return  (*)
 ********************************************************************************************************/
static void Timer0_Init(void)
{
/**********************************TIM0配置初始化**************************************/
	TCON1 = 0x01;						//Tx0定时器时钟为Fosc
	TMOD = 0x00;						//16位重装载定时器/计数器

	//Tim0计算时间 	= (65536 - 0xFACB) * (1 / (Fosc /Timer分频系数))
	//				= 1333 / (16000000 / 12)
	//				= 1 ms

	//定时1ms
	//反推初值 	= 65536 - ((1/1000) / (1/(Fosc / Timer分频系数)))
	//		   	= 65536 - ((1/1000) / (1/(16000000 / 12)))
	//			= 65536 - 1333
	//			= 0xFACB
	TH0 = (65536 - 125 * 16)/256;
	TL0 = (65536 - 125 * 16)%256;							//T0定时时间125us
	IE |= 0x02;							//打开T0中断
	TCON |= 0x10;						//使能T0
    

}





void WDT_Init(void)
{
/*************** *********************系统初始化****************************************/
	WDTCCR = 0x00;				 		         //关闭看门狗
		                                 //本例程为方便测试关闭看门狗，实际使用中，建议客户打开看门狗，详见WDT复位例程
	CLKSWR = 0x51;						         //选择内部高频RC为系统时钟，内部高频RC 2分频，Fosc=16MHz
	CLKDIV = 0x01;						         //Fosc 1分频得到Fcpu，Fcpu=16MHz 

/***********************************WDT配置初始化**************************************/
	WDTC = 0x57;						           //允许WDT复位，允许掉电/空闲模式下运行，1024分频

	//WDT使用的是RC44K时钟，WDT_CLOCK_1024是1024分频，初值为0xFF
	//定时时间 	= 1024 * 0xFF / 44000
	//			    = 5.93s

	WDTCCR = 0xFF;						         //写入00时，将关闭WDT功能（但不关闭内部低频RC），
										         //即相当于禁止WDT。写入非0数据时，将启动WDT。
}


/********************************************************************************************************
* @ name   : void SystemInit(void)
* @ msg    : 
* @ param   (*)
* @ return  (*)
 ********************************************************************************************************/
void SystemInit(void)
{
//	SetStr((uchar *)&g_u16DispSeg, 0, sizeof(g_u16DispSeg));
//	SetStr((uchar *)&g_u16DispLowSeg, 0, sizeof(g_u16DispLowSeg));
	
}


/********************************************************************************************************
* @ name   : void F_McuInit(void)
* @ msg    : 
* @ param   (*)
* @ return  (*)
 ********************************************************************************************************/
void F_McuInit(void)
{
	Di();
	WDT_Init();
	IO_Init();
	F_SYSUartInit();
	F_SYSUart2Init();//0824
	Timer0_Init();
	Ei();
}




